app/controllers/admins/categories_controller.rb

SELECT COUNT(*) FROM "categories"
---
  def index
    @q = Category.ransack(params[:q])
    @q.sorts = "created_at desc" if @q.sorts.empty?