app/views/users/show.html.erb

  <% else %>
    <%= link_to "Мои записи #{current_user.doctor_appointments.count}", appointments_path, class: "btn text-white mx-3", style: "background: #1ec8c8;" %>
---
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."doctor_id" = $1  [["doctor_id", 93]]