app/controllers/appointments_controller.rb

UPDATE "appointments" SET "updated_at" = $1, "status" = $2 WHERE "appointments"."id" = $3  [["updated_at", "2022-08-08 14:03:00.581381"], ["status", "open"], ["id", 6]]
---
  def update
    if limit_appointment_with_open_status && @appointment.update(status: Appointment.status.open)