app/controllers/recommendations_controller.rb

  def create
    @recommendation = current_user.recommendations.build(recommendation_params)

    if @recommendation.save
---
INSERT INTO "recommendations" ("user_id", "appointment_id", "answer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 93], ["appointment_id", 8], ["answer", "test"], ["created_at", "2022-08-08 14:08:01.922261"], ["updated_at", "2022-08-08 14:08:01.922261"]]