app/views/appointments/show.html.erb

      <div class="card-body">
        <p><%= @appointment.recommendation.present? ? @appointment.recommendation.answer : "" %></p>
---
SELECT "recommendations".* FROM "recommendations" WHERE "recommendations"."appointment_id" = $1 LIMIT $2  [["appointment_id", 6], ["LIMIT", 1]]